app/Models/ModelUser.php

    public function cekNomor($nomor)
    {
        return $this->where('nomor_telepon', $nomor)
            ->get();
---
SELECT *
FROM `user`
WHERE `nomor_telepon` = '123454321'

    public function getById($id)
    {
        return $this->where(['id' => $id])->get();
---
SELECT *
FROM `user`
WHERE `id` = '1'