app/Models/ModelSurvey.php

    public function getByUserId($id_user)
{
    return $this->where('id_user', $id_user)->get();
---
SELECT *
FROM `survey`
WHERE `id_user` = '1'