app/Models/ModelInformasi.php

    public function getInformasi()
    {
        return $this->get();
---
SELECT *
FROM `informasi`